In [1]:
import pandas as pd

In [8]:
df = pd.DataFrame({
  "Accessories": ["Laptop", "Laptop", "Ipad", "Ipad", "Tablet", "Laptop"],
  "customer": ["Andrew", "Andrew", "Tom", "Andrew", "Tobey", "Peter"],
  "quantity": [1, 2, 2, 3, 1, 2],
})

In [9]:
df.set_index(["Accessories", "customer"])["quantity"]

Accessories  customer
Laptop       Andrew      1
             Andrew      2
Ipad         Tom         2
             Andrew      3
Tablet       Tobey       1
Laptop       Peter       2
Name: quantity, dtype: int64

In [10]:
df.groupby(['Accessories', 'customer']).quantity.sum()

Accessories  customer
Ipad         Andrew      3
             Tom         2
Laptop       Andrew      3
             Peter       2
Tablet       Tobey       1
Name: quantity, dtype: int64

In [2]:
df = pd.DataFrame({'Date':["2015-12-06", "2011-12-27", "2015-09-07", "2012-12-21", "2020-02-13", "2015-06-09"], 
                   'RID':[498, 721, 375, 464, 813, 853], 'Phy':[22, 45, 1, 65, 22, 17], 
                   'Chem':[52, 56, 32, 50, 24, 61], 'Math':[63, 37, 68, 62, 43 ,42]})

In [3]:
df

         Date  RID  Phy  Chem  Math
0  2015-12-06  498   22    52    63
1  2011-12-27  721   45    56    37
2  2015-09-07  375    1    32    68
3  2012-12-21  464   65    50    62
4  2020-02-13  813   22    24    43
5  2015-06-09  853   17    61    42

In [4]:
df["Month"] = pd.to_datetime(df["Date"]).dt.strftime('%b')

In [5]:
df["Month"]

0    Dec
1    Dec
2    Sep
3    Dec
4    Feb
5    Jun
Name: Month, dtype: object

In [7]:
df["Month"] = df["Month"].str.upper()
df["Month"]

0    DEC
1    DEC
2    SEP
3    DEC
4    FEB
5    JUN
Name: Month, dtype: object

In [8]:
d = df.groupby("Month").agg({"Date":"count","Chem":"mean","Phy":"mean", "Math":"mean"}).reset_index().round(2)

In [9]:
d

  Month  Date   Chem   Phy  Math
0   DEC     3  52.67  44.0  54.0
1   FEB     1  24.00  22.0  43.0
2   JUN     1  61.00  17.0  42.0
3   SEP     1  32.00   1.0  68.0

In [11]:
d.sort_values(by=["Date", "Month"], ascending=[False, True], inplace=True)
d

  Month  Date   Chem   Phy  Math
0   DEC     3  52.67  44.0  54.0
1   FEB     1  24.00  22.0  43.0
2   JUN     1  61.00  17.0  42.0
3   SEP     1  32.00   1.0  68.0

In [12]:
pd.Series(d.loc[d.index[0]].values)

0      DEC
1        3
2    52.67
3     44.0
4     54.0
dtype: object